# Практическое задание по теме: "Словари и множества"
# Цель: Написать программу на языке Python, используя Pycharm, для работы со словарями и множествами.
# 1. В проекте, где вы решаете домашние задания, создайте модуль 'module_1_6.py' и напишите весь код в нём.
# 2. Работа со словарями:
# - Создайте переменную my_dict и присвойте ей словарь из нескольких пар ключ-значение.
# Например: Имя(str)-Год рождения(int).
# - Выведите на экран словарь my_dict.
# - Выведите на экран одно значение по существующему ключу, одно по отсутствующему из словаря my_dict без ошибки.
# - Добавьте ещё две произвольные пары того же формата в словарь my_dict.
# - Удалите одну из пар в словаре по существующему ключу из словаря my_dict и выведите значение из этой пары на экран.
# - Выведите на экран словарь my_dict.
# 3. Работа с множествами:
# - Создайте переменную my_set и присвойте ей множество, состоящее из разных типов данных с повторяющимися значениями.
# - Выведите на экран множество my_set (должны отобразиться только уникальные значения).
# - Добавьте 2 произвольных элемента в множество my_set, которых ещё нет.
# - Удалите один любой элемент из множества my_set.
# - Выведите на экран измененное множество my_set.
# Примечания:
# - Для вывода значений на экран используйте функцию print().
# - Помните, что словарь и множество - неупорядоченные коллекции.
# - Больше о методах словарей тут, множеств тут.
# Пример результата выполнения программы:
# Dict: {'Vasya': 1975, 'Egor': 1999, 'Masha': 2002}
# Existing value: 2002
# Not existing value: None
# Deleted value: 1999
# Modified dictionary: {'Vasya': 1975, 'Kamila': 1981, 'Artem': 1915, 'Masha': 2002}
# Set: {1, 'Яблоко', 42.314}
# Modified set: {'Яблоко', 42.314, 13, (5, 6, 1.6)}


################ Решение ################
my_dict = {"Danila": 2001, "Anton": 1996}

print(f'Dict: {my_dict}')
print(f'Existing value: {my_dict["Danila"]}')
print(f'Not existing value: {my_dict.get('Alina', None)}')
my_dict.update({"Masha": 2004, "Alisa": 2003})
print(f'Deleted value: {my_dict.pop("Anton")}')
print(f'Modified dictionary: {my_dict}')


################ Множества ################
my_set = {42, "dog", 3.14, 2,  3, 4, 3, 2, True, (2, 3, 5)}
my_set.add(25)
print(f'\nSet: {my_set}')
my_set.remove(1)
print(f'Modified set: {my_set}')